1s/ERP/Conf/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаПоАдресу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПолучателюОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеЭкспедиторуВПункте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяВРаспоряжении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоКлиентаКурьером</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СпособыДоставки/Ext/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет представление переданного способа доставки.
//
// Параметры:
//   СпособДоставки - ПеречислениеСсылка.СпособыДоставки - способ доставки для получения представления.
//
// Возвращаемое значение:
//   Строка - представление способа доставки.
//
Функция ПредставлениеСпособаДоставки(СпособДоставки) Экспорт

	ПредставленияСпособовДоставки = ПредставленияСпособовДоставки();
	
	ПредставлениеСпособаДоставки = ПредставленияСпособовДоставки[СпособДоставки];
	Если ПредставлениеСпособаДоставки = Неопределено Тогда
		ПредставлениеСпособаДоставки = Строка(СпособДоставки);
	КонецЕсли;
	
	Возврат ПредставлениеСпособаДоставки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор представлений способов доставки.
//
// Возвращаемое значение:
//   Соответствие - список представлений:
//    * Ключ - ПеречислениеСсылка.СпособыДоставки - способ доставки.
//    * Значение - Строка - представление способа доставки.
//
Функция ПредставленияСпособовДоставки()

	ПредставленияСпособовДоставки = Новый Соответствие;
	
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.Самовывоз,
											НСтр("ru = 'Самовывоз (с нашего склада)';
												|en = 'Pickup from warehouse'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.ДоКлиента,
											НСтр("ru = 'Наша транспортная служба до клиента';
												|en = 'In-house carrier'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу,
											НСтр("ru = 'Наша транспортная служба до перевозчика';
												|en = 'In-house carrier (delivery to shipping company)'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.СиламиПеревозчика,
											НСтр("ru = 'Перевозчик (с нашего склада)';
												|en = 'Outsourced carrier'"));
	ПредставленияСпособовДоставки.Вставить(Перечисления.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки,
											НСтр("ru = 'На усмотрение транспортной службы';
												|en = 'Define later'"));
	
	Возврат ПредставленияСпособовДоставки;

КонецФункции

#КонецОбласти

#КонецЕсли
